In [1]:
import pandas as pd
import numpy as np

# Load data

In [2]:
train_df = pd.read_csv('train.csv')
test_df = pd.read_csv('test.csv')
test_ans_df = pd.read_csv('gender_submission.csv')

In [3]:
test_data = test_df.merge(test_ans_df, on='PassengerId')
tita_df = pd.concat([train_df, test_data])
tita_df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

## Numero de personas

In [21]:
tita_df.shape[0]

1309

## Hombres y mujeres que sobrevivieron

In [17]:
male_survivers = tita_df[(tita_df['Survived']== 1) & (tita_df['Sex']== 'male')].shape[0]
male_survivers

109

In [20]:
female_survivers = tita_df[(tita_df['Survived']== 1) & (tita_df['Sex']== 'female')].shape[0]
female_survivers

385

## Top 10 survivers and not by Age

In [49]:
total_survived = tita_df.shape[0]
total_age=tita_df.dropna(subset=['Age'])
total_with_age=total_age.shape[0]
print(f'Droped {total_survived-survived_with_age} persons without Age')

Droped 892 persons without Age

In [53]:
total_age['Age']=total_age['Age'].apply(int)
survived_age_count=total_age[total_age['Survived']== 1].groupby(by=['Age'])['Age'].count().to_frame('Total')
survived_age_count.sort_values(by='Total', ascending=False, inplace=True)
print('Top ages survived')
survived_age_count.head(10)

Top ages survived

     Total
Age
22      21
24      20
18      17
30      16
36      16
27      15
35      14
29      13
19      12
45      12

In [55]:
not_survived_age_count=total_age[total_age['Survived']== 0].groupby(by=['Age'])['Age'].count().to_frame('Total')
not_survived_age_count.sort_values(by='Total', ascending=False, inplace=True)
print('Top ages that not survived')
not_survived_age_count.head(10)

Top ages that not survived

     Total
Age
21      33
24      28
25      27
30      26
28      26
18      25
22      23
26      21
32      18
29      17

## Title Mrs, Miss in the Titanic

In [63]:
tita_df['title'] = tita_df['Name'].apply(lambda x: x.split('.')[0].split(',')[-1].strip())
print('Was a total of {} titles in the ship'.format(pd.unique(tita_df['title']).size))

Was a total of 18 titles in the ship

## Valor tickets in USD

In [28]:
survived_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [30]:
tita_df['Fare'].sum()

43550.4869

In [65]:
tita_df.to_csv('titanic_data_titles.csv')